title: ASDU Rate Flooding Detection (DoS)
id: 640dcc60-9bbe-4a4c-872a-146dcb54ca12
description: Detects abnormally high ASDU transmission frequency from an RTU, indicating
  flooding, replay, or DoS conditions.
status: test
author: sigurdog
date: 2026/04/27

logsource:
  product: network
  service: ids

fields:
  - id.orig_h
  - asdu_type

detection:
  selection:
    id.orig_h: "10.20.0.133"
    asdu_type: "*"

  condition: selection

falsepositives:
  - RTU cold start bursts
  - IDS hickup