title: IEC-104 Port Misuse or Abnormal TCP Session Patterns
id: 03781f27-3b4c-4e36-8127-8827fbfda0e3
description: Detects IEC-104 traffic on ports that is not the default 2404,
  detected by looking for an ASDU field.
status: test
author: sigurdog
date: 2026/04/22

logsource:
  category: network_traffic
  product: network
  service: ids

fields:
  - id.orig_h
  - id.resp_h
  - id.resp_p

detection:
  iec104_traffic:
    id.orig_h: "10.20.0.124"
    id.resp_h: "10.20.0.133"

  has_asdu:
    asdu_type|exists: true

  port_2404:
    id.resp_p: 2404

  condition: iec104_traffic and has_asdu and not port_2404

falsepositives:
  - Redundant or failover using alternative ports